Repository: Ukrainian-Irdya-Project/wesnoth-uk
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: uk_ua

source: When a river happens to be extremely shallow, passing over it is a trivial matter for land based units. Moreover, any creature best adapted to swimming has full mobility even at such places in the river. As far as gameplay is concerned, a river ford is treated as either grassland or shallow water, choosing whichever one offers the best defensive and movement bonuses for the unit on it.
uk_ua: Коли річка стає дуже мілкою, її легко можуть перейти сухопутні бійці. Тим не менше, будь-яка водна істота також зможе необмежено рухатися у таких місцях річки. З точки зору гри, річковий брід розглядається або як пасовище або як мілка вода, залежно від того, де краще захист та пересування для бійця.

source: When a server message is received
uk_ua: Коли отримано повідомлення від серверу

source: When a tough unit is heavily injured, send it to heal in a village several turns’ movement away from the fighting. Then it can recover in peace (at 10 hitpoints per turn) without tying up front-line villages.
uk_ua: Коли сильний боєць важко поранений, відправте його до села, розташованого в декількох ходах від лінії фронту. Там він зможе швидко відновитися (10 ЗД за хід), не займаючи села на передовій.

source: When a troll, gifted with abnormal strength of life, matches that with age and wisdom, it becomes something extraordinary, a beast remembered for generations. Their feats of strength and cunning are the source of most tales about trolls, and to see the stories made flesh does nothing to diminish their grandeur.
uk_ua: Коли троль, обдарований незвичайною життєвою силою, досягає розквіту своїх років і мудрості, він стає легендою на довгі покоління. Їх сила і спритність — джерело усіх легенд про тролів, і хоча легенди складаються ще за життя, це анітрохи не зменшує їх ведич.

source: When a unit gains enough experience points (the <i>experience bar</i>, if present, is on the <b>right</b> of the <i>hitpoints bar</i>), it will gain a level. Elvish Fighters have two advancement options, and you will be able to choose which one you want. However, second level units cost twice as much to support as first level units.
uk_ua: Коли боєць набере достатньо досвіду (<i>індикатор досвіду</i>, якщо він є, розміщено <b>справа</b> від <i>індикатора здоров'я</i>), він перейде на наступний рівень. Ельфійські воїни можуть розвиватись двома шляхами; який з них вибрати — вирішувати вам. Однак, бійці другого рівня вимагають в два рази більше утримання, ніж бійці першого рівня.

source: When a unit in the front line is heavily damaged you can move him safely behind your defensive line. To hold up the line, you will most likely have to replace him with a reserve, so hold a couple of units in back of the front line. If you have healers, damaged units in the second line will quickly recover.
uk_ua: Якщо боєць на передній лінії важко поранений, ви можете перемістити його у безпечне місце позаду лінії оборони. Щоб утримати лінію, вам знадобиться замінити його, тому тримайте кілька резервних бійців напоготові зразу за лінією фронту. Якщо у вас є цілителі, поранені бійці зможуть швидко відновитися.

source: When a unit is killed by a Plague attack, that unit is replaced with a Walking Corpse on the same side as the unit with the Plague attack. This doesn&#8217;t work on Undead or units in villages.
uk_ua: Коли боєць убитий чумою, він замінюється Ходячим трупом і переходить на бік ворога. Це не діє на нежить і на бійців, що знаходяться в селах.

source: When a unit is killed by a Plague attack, that unit is replaced with a Walking Corpse on the same side as the unit with the Plague attack. This doesn’t work on Undead or units in villages.
uk_ua: Коли боєць убитий чумою, він замінюється Ходячим трупом і переходить на бік ворога. Це не діє на нежить і на бійців, що знаходяться в селах.

source: When a unit is killed by a Plague attack, that unit is replaced with a unit on the same side as the unit with the Plague attack. This doesn’t work on Undead or units in villages.
uk_ua: Коли боєць убитий чумою, він замінюється Ходячим трупом і переходить на бік ворога. Це не діє на нежить і на бійців, що знаходяться в селах.

source: When a whisper is received
uk_ua: Коли отримано шепіт

source: When facing an unknown situation, take into account details from story and dialog to inform your strategy.
uk_ua: Зіткнувшись з невідомою ситуацією, беріть до уваги деталі історії та діалогів, щоб розробити найкращу стратегію.

source: When light came into the world and gave form to the unknown, fear was forced to retreat into darkness. Since that day, the shadows of the world have held terror for humanity, though it knows not why. That is a question which is easily answered by a necromancer.
uk_ua: Коли до світу прийшло світло і надало форми невідомому, страх був змушений відступити в темряву. Відтоді тіні всього світу вселяють жах людству, хоча невідомо, чому. Зате на це питання дуже легко дасть відповідь некромант.

source: When moving a unit, the percentages shown are the unit’s defense on that hex. The higher the number, the less likely they are to get hit.
uk_ua: Рухаючи бійця, на клітинках відображатимуться відсотки, котрі показують його захист на тій місцевості. Чим більше число, тим менше ймовірність, що в бійця влучать.

source: When playing a multiplayer game, you do not control what a unit advances to if it advances on another player’s turn. With this modification you can set what your units advance to beforehand, either for a specific unit or for all units of the same type.
uk_ua: У багатокористувацькій грі, ви не можете вибрати підвищення бійця, якщо воно відбулося не на вашому ході. Ця модифікація дозволяє запланувати підвищення заздалегідь, як для одного бійця, так і для всіх бійців цього типу.

source: When reporting the bug please include the following error message :
uk_ua: Якщо посилатимете багрепорт, включіть, будь ласка, наступне повідомлення :

source: When still young, Ogres are sometimes captured and taken into armies to be trained. They cannot manage weapons skillfully, but they compensate for that lack with great strength.
uk_ua: Молодих огрів іноді захоплюють і відправляють в армію для навчання. Вони не дуже майстерно володіють зброєю, але цей недолік компенсується величезною силою.

source: When the game exceeds the number of turns indicated by the second number, it will end.
uk_ua: Коли кількість ходів у цій грі перевищить число ходів, вказане другим числом, гра закінчиться.

source: When the game you are hosting is ready to start
uk_ua: Коли гра, яку ви захостили, готова до старту

source: When the host (not you) has started the game
uk_ua: Коли хост (не ви) почав гру

source: When the mage isss dead and her dead horde put to ressst, we agree. We will have been compensssated adequately.
uk_ua: Як уб'ємо чарівницю та розправимос-с-ся з її ордою мерців, тоді згода: вважатимемо, що розплатилис-с-ся.

source: When the men of Wesnoth first encountered the dwarves, they were mystified by the power of the Dwarvish Thunderers, who were able to hurl death from afar through the apparatus of these strange wands they carried into battle. The deafening noise of these ‘thundersticks’ is terrifying to behold, and is made more so by the secrecy which dwarves wrap about their workings.
uk_ua: Коли люди Весноту вперше зустріли гномів, то були здивовані потужністю гномів громовержців, здатних здалека насилати смерть за допомогою дивних жезлів, з якими вони виходять на поле бою. Приголомшуючий шум цих ‘громових палиць’ вселяє страх, а те, як гноми бережуть їх секрет, робить їх ще страшнішими.

source: When the orcish hordes first began arriving in droves on the Great Continent, one intrepid ruler by the name of Iron-King Olgor set about first uniting the bickering orcish tribes. He sought to conquer the whole of the Continent under the rule of orcs, and commanded the construction of the immense fortress of Pyrennis as a monument to his power. But it was this very citadel that was his undoing — his vassals, unwilling to finish building without their destined conquest complete, turned on Olgor and slayed him, scattering the orcish hosts for centuries to come. The walls of Pyrennis have proved astoundingly indestructible both to time and war — that is, what scattered segments of it were actually completed.
uk_ua: Коли орські орди вперше почали прибувати на Великий континент, один відважний правитель на імʼя Залізний Король Олгор почав обʼєднувати розрізнені оркські племена. Він прагнув завоювати весь Великий контитент під владу орків, і почав будівництво величезної фортеці Пуренніс, як монумент своїй силі. Але ця цитадель його й згубила — його васали не бажали закінчувати будівництво, доки все не завоюють, а тому повстали проти Олгора та й вбили його. Це відкинуло панування орків на століття назад. Стіни Пуренніса не змогли зруйнувати ні війни, ні час — принаймні ті, які все ж таки встигли побудувати.

source: When used defensively, this attack reduces the opponent’s chance to hit by 10%.
uk_ua: При обороні ця атака зменшує шанс ворога влучити на 10%.

source: When used offensively, this attack always has at least a 60% chance to hit.
uk_ua: При нападі ця атака завжди має шанс не менше 60% попасти в ціль.

source: When used offensively, this attack deals double damage if there is an enemy of the target on the opposite side of the target, and that unit is not incapacitated (e.g. petrified).
uk_ua: У нападі ця атака наносить подвійну шкоду, якщо з протилежного боку атакованого бійця його відволікає противник, і цей противник не виведений з ладу (наприклад, перетворений на камінь чи паралізований).

source: When used offensively, this attack deals double damage if there is an enemy of the target on the opposite side of the target, and that unit is not incapacitated (turned to stone or otherwise paralyzed).
uk_ua: У нападі ця атака наносить подвійну шкоду, якщо з протилежного боку атакованого бійця його відволікає противник, і цей противник не виведений з ладу (наприклад, перетворений на камінь чи паралізований).

source: When used offensively, this attack deals double damage to the target. It also causes this unit to take double damage from the target&#8217;s counterattack.
uk_ua: При використанні в нападі ця атака наносить ворогу подвійну шкоду. Боєць також отримає подвійну шкоду від удару у відповідь.

source: When used offensively, this attack deals double damage to the target. It also causes this unit to take double damage from the target’s counterattack.
uk_ua: При використанні в нападі ця атака наносить ворогу подвійну шкоду. Боєць також отримає подвійну шкоду від удару у відповідь.

source: When you first start a scenario or campaign you will only have a few units on the map. One of these will be your commander (identified by a little golden crown icon). Your commander is usually placed in a castle on a special hex called a keep. Whenever your commander is on a keep (not only your own, but also the keep of any enemy castles you capture) and you have enough gold, you can recruit units for your army. In later scenarios you can recall experienced units that survived earlier scenarios. From here, you can start to build your army to conquer the enemy.
uk_ua: Коли ви тільки починаєте сценарій, або кампанію, у вас на карті лише декілька бійців. Один з них - ваш командир (позначається невеликою золотою короною). Ваш командир зазвичай розміщується в замку, в особливому полі. що зветься укриття. Якщо ваш командир в укритті (не лише у своєму, але і в укритті будь-якого ворожого замку, який ви захопите) і у вас є досить золота, ви можете вербувати бійців для своєї армії. У подальших сценаріях ви можете закликати досвідчених бійців, що вижили в попередніх сценаріях. Таким чином можете починати будувати свою армію для підкорення противника.

source: When you have a White Mage (advances from Mage) or Druid (advances from Shaman), put it in the middle of a circle of units to heal them as they move across the map (Shamans can do this too, but not as well).
uk_ua: Коли у вас є білий маг (просувається з мага) або друїд (просувається з шамана), поставте їх в центрі кола бійців, щоб вони зціляли їх під час руху ваших військ по карті (шамани теж можуть це робити, але не так добре).

source: When you hover over or select a unit, in this case Konrad, the places he can move to are highlighted. All units have a certain number of <i>movement points</i>, which dictate how many hexes that unit can move per turn. Normally, moving one hex on flat terrain uses one movement point. To move, simply click on Konrad and then your destination. (You can press <b>u</b> to undo a move if you move to the wrong place.)
uk_ua: Коли ви наводите мишу на бійця, у цьому випадку Конрада, або вибираєте його, підсвічуються місця, куди він може походити. Усі бійці мають певну кількість <i>очок руху</i>, які визначають як далеко може походити боєць. Зазвичай, одна клітинка плоскої місцевості використовує одне очко руху. Щоб здійснити пересування, просто клікніть на Конраді, і потім на клітинку призначення. (Якщо ви походили не туди, ви можете відмінити хід, натиснувши <b>u</b>.)

source: When you hover over or select a unit, in this case Li’sar, the places she can move to are highlighted. All units have a certain number of <i>movement points</i>, which dictate how many hexes that unit can move per turn. Normally, moving one hex on flat terrain uses one movement point. To move, simply click on Li’sar and then your destination. (You can press <b>u</b> to undo a move if you move to the wrong place.)
uk_ua: Коли ви наводите мишу на бійця, у цьому випадку Ліʼсар, або вибираєте його, підсвічуються місця, куди він може походити. Усі бійці мають певну кількість <i>очок руху</i>, які визначають як далеко може походити боєць. Зазвичай, одна клітинка плоскої місцевості використовує одне очко руху. Щоб здійснити пересування, просто клікніть на Ліʼсар, і потім на клітинку призначення. (Якщо ви походили не туди, ви можете відмінити хід, натиснувши <b>u</b>.)

source: When you win a scenario, the map grays over and the <bold>text='End Turn'</bold> button changes to <bold>text='End Scenario'</bold>. You can now do things like changing your save options or (if you are in a multiplayer game) chatting with other players before pressing that button to advance.
uk_ua: Після перемоги в сценарії карта стане сірою і кнопка <bold>text='Завершити хід'</bold> зміниться на <bold>text='Скінчити місію'</bold>. Перш ніж продовжити Ви зможете, наприклад, змінити параметри збереження, або поспілкуватися в чаті з іншими гравцями у мультиплеєрі.

source: When you win a scenario, the map will gray over and the <emphasis>End Turn</emphasis> button will change to <emphasis>End Scenario</emphasis>. You can now do things like changing your save options or (if you are in a multiplayer game) chatting with other players before pressing that button to advance.
uk_ua: Коли сценарій виграний, карта стане сірою і кнопка <emphasis>Закінчити хід</emphasis> заміниться на <emphasis>Закінчити сценарій</emphasis>. Тепер ви можете, наприклад, змінити ваші налаштування, або (в мережевій грі) поспілкуватися в чаті з іншими гравцями, перш ніж натискати цю кнопку і рухатися далі.

source: When your armies meet, you may want to try to be the first to attack. So try to end your move out of striking range of the enemy army. He cannot attack but most likely will close into your striking range.
uk_ua: Коли армії сходяться, ви, можливо, захочете атакувати першим. Тоді спробуйте закінчити ваші ходи так, щоб противник не зміг вас дістати. Він не зможе атакувати, але, мабуть, підійде ближче і буде доступний для ваших атак.

source: When your grandfather married Indress, he did not know that Tyegëa had already born him a son. When she delivered your father to Jotha, your grandmother Indress agreed to keep it secret and raise the infant as her own.
uk_ua: Коли твій дід одружився на Індрес, він не знав, що Тигея народила йому сина. Коли вона доставила твого батька на Йоту, твоя бабуся Індрес погодилася тримати це в секреті, і виростити дитя, як своє власне.

source: Whenever its berserk attack is used, this unit continues to push the attack until either it or its enemy lies dead.
uk_ua: Незалежно від того, захищається чи атакує берсерк, він завдаватиме ударів до тих пір, поки не буде вбитий він або його ворог.

source: Whenever one of your units is selected, you’ll see varying percentages as you move the mouse over the map. The higher the percentage, the more <i>defense</i> that unit has in that kind of terrain. For example, most units have good defenses in castles and villages but poor defenses in rivers. Some units, like these quintains, have a <i>magical</i> attack, which always has a 70% chance of hitting no matter what terrain their targets occupy.
uk_ua: Кожний раз, коли один з ваших бійців вибраний, ви побачите змінювані відсотки при русі курсора миші на карті. Чим вище відсоток, тим більший <i>захист</i> бійця в обраній місцевості. Наприклад, більшість бійців мають гарний захист в замках і селах, та погану оборону в річках. Деякі бійці, такі як цей стоп, використовують <i>магічну</i> атаку, яка завжди має 70% шанс потрапляння незалежно від того, на яку місцевість націлена.

source: Whenever you see a target that looks like this, you should move your leader (or whatever unit the dialog just suggested) onto the hex that contains it.
uk_ua: Коли ви бачите такий значок, це означає, що ви повинні поставити на клітинку з ним свого лідера (чи іншого бійця, про якого сказано в діалогах).

source: Whenever you’re on a <i>keep</i>, you can <i>recruit</i> units on the castle tiles around it by right-clicking and selecting <b>Recruit</b>. Note that newly recruited units cannot act the turn you recruit them; you will be able to use them next turn. For this scenario, you have only one type of unit to choose from: the Elvish Fighter.
uk_ua: Коли ви у <i>фортеці</i>, ви можете <i>наймати</i> воїнів в замку в клітинках навколо. Для цього натисніть праву кнопку миші та виберіть пункт меню <b>Вербувати</b>. Зверніть увагу: тільки що найняті бійці не можуть ходити або битися на цьому ходу; ви зможете їх використовувати лише на наступному. Зараз ви можете вибрати лише один тип солдат: ельфійський воїн.

source: Where <i>is</i> Karrag? We can’t have been more than seconds behind him.
uk_ua: <i>Де</i> Карраґ? Ми не можемо бути більш ніж на секунди позаду нього.

source: Where did he go?
uk_ua: Куди він пішов?

source: Where is my gold?!
uk_ua: Де моє золото?!

source: Whether I can succeed or not, I must try. Will you help me find it?
uk_ua: Не знаю, чи вийде у мене, але я повинен спробувати. Ти допоможеш мені знайти його?

source: Whether the replay will be publicly available
uk_ua: Визначає чи буде повтор матчу публічно доступним

source: Whether to show all installed add-ons or only your add-ons
uk_ua: Показувати усі встановленні аддони або лише ваші

source: Whether to use your forum username and password when uploading or to store your password and email address in the add-on’s _server.pbl.
uk_ua: Використовувати ваш аккаунт з форуму при завантаженні аддону чи зберігати пароль та пошту в файлі _server.pbl.

source: Whether used offensively or defensively, this attack presses the engagement until one of the combatants is slain, or 3 rounds of attacks have occurred.
uk_ua: Незалежно від того, чи використовується вона в атаці чи обороні, ця зброя змушує продовжувати бій до тих пір, поки один з бійців не буде вбитий, або поки не відбудеться 3 раунди.

source: Whether used offensively or defensively, this attack presses the engagement until one of the combatants is slain, or 30 rounds of attacks have occurred.
uk_ua: І у наступі і в обороні продовжує бій, поки один з бійців не загине, або доки не пройдуть 30 раундів бою.

source: Which team this side belongs to
uk_ua: До якої команди належить ця сторона

source: Which type of unit would you like to be able to recruit?
uk_ua: Яких бійців ви би хотіли змогти завербувати?

source: While Delfador was still at the Academy, major events were taking place throughout Wesnoth. After centuries of squabbling, a warlord emerged to unite the orcs. This was ill tidings for humans and elves alike.
uk_ua: Поки Делфадор все ще був в Академії, у Весноті відбувалися важливі події. Після віків постійних суперечок і дрібних сутичок, з'явився воєначальник, здатний об'єднати орків. Це були погані вісті для людей, та і для ельфів теж.

source: While finishing early gives a gold bonus, and reduces the opportunities for enemies to kill your valuable troops, it also means you lose chances to earn your units extra experience. When deciding whether or not to finish a scenario early, weigh these factors against one another.
uk_ua: Хоча швидке завершення кампанії дає бонусне золото, і зменшує вірогідність того, що ваші бійці будуть вбиті, воно також зменшує кількість досвіду, який можуть отримати ваші бійці. Коли вирішуватимете, завершувати сценарій, чи ні, зважте плюси і мінуси обох варіантів.

source: While it appears fortune favored us this time, I fear for the travelers for whom this man does <i>not</i> keep his word...
uk_ua: Хоч нам і пощастило, я хвилююся за мандрівників, з якими цей чоловік <i>не</i> дотримався свого слова...

source: While most units have three levels, not all do. Occasional units (such as <ref>dst='unit_Mage' text='magi'</ref>) may have four. Once a unit has reached its maximum level, it may have an <italic>text='After Maximum Level Advancement'</italic> (AMLA) available to it. The AMLA will modify the unit each time the unit reaches the experience goal, but the unit will remain the same level. The typical AMLA effect is for the unit to raise the maximum HP by 3 and full-heal it. The first AMLA will normally be reached with 150 XP gained (120 XP for intelligent units). However, gaining an AMLA becomes progressively harder for each AMLA the unit receives, and so it is usually more useful to try to advance your lower level units.
uk_ua: Більшість бійців мають три рівні розвитку. Деякі бійці (як, наприклад, <ref>dst='unit_Mage' text='маги'</ref>) можуть мати чотири. Після досягнення свого максимального рівня бійцеві стає доступне <italic>text='Поліпшення ПостМаксимального Рівня'</italic> (ППМР). ППМР модифікуватиме бійця кожного разу, коли він набирає встановлену кількість очків досвіду, але рівень його залишиться тим же. Типова дія ППМР на бійця полягає в підвищенні максимальної кількості HP на 3 і повному зціленні. Перше ППМР боєць зазвичай отримує досягнувши 150 ДВ (120 ДВ для розумних). Проте подальше отримання ППМР даватиметься все складніше і складніше, тому набагато корисніше просувати бійців нижчих рівнів.

source: While none of your recruited units can move yet, you still can. You need more income; there are some villages near the keep you can capture.
uk_ua: Ніхто з твоїх нових бійців не може ходити, зате ти ще можеш. Тобі потрібен додатковий прибуток; ти можеш захопити декілька сіл поруч з замком.

source: While playing, keep in mind that you can mouse-over many items in the game, such as the information displayed in the status pane, to see a brief description explaining each item. This is especially useful when you encounter new elements, such as <ref>dst='..abilities_section' text='abilities'</ref>, for the first time.
uk_ua: Граючи, пам'ятайте, що можна навести курсор миші на будь-який об'єкт — наприклад, на інформацію в рядку стану — і тоді з'явиться короткий опис цього об'єкту. Це особливо корисно при вивченні нових <ref>dst='..abilities_section' text='здібностей'</ref>.
